BEGIN TRANSACTION;
CREATE TABLE IF NOT EXISTS "person" (
	"id"	INTEGER PRIMARY KEY AUTOINCREMENT,
	"category"	TEXT,
	"name"	TEXT,
	"field"	TEXT,
	"disc"	TEXT,
	"image"	TEXT,
	"fav"	INTEGER DEFAULT 0
);
INSERT INTO "person" ("id","category","name","field","disc","image","fav") VALUES (1,'foreign',' آلبرت انیشتین','فیزیک','با توجه به گذشته ی البرت انیشتین، هیچ کس فکر نمی کرد پسری که تا سه سالگی نمی توانست حرف بزند و تا هشت سالگی نمی توانست بخواند، یکی از بزرگترین دانشمندان تاریخ باشد. با وجود موانعی که در پیش داشت توانست جایزه ی صلح نوبل را به خاطر تلاش هایی که در زمینه ی فیزیک انجام داد، بگیرد.','http://uupload.ir/files/kfe_1_anstain.jpg',0),
 (2,'foreign','نیکولا تسلا','برق و الکترونیک','تسلا فردی است که در هنگام روشن کردن یک سوئیچ بزرگ الکتریک باید تصویر وی را در ذهن داشت. وی به عنوان مخترع رادیوی بی‌سیم و ژنراتورهایی که کلید آغاز عصر الکتریک به شمار می‌رود، شناخته می‌شود او یک نابغه دیوانه بود زیرا بسیار کم خوابیده و از بدن خود به عنوان ابزاری رسانا برای نمایش دستاوردهایش در جمع استفاده می‌کرد.','http://uupload.ir/files/5b24_2_nicola-tesla.jpg',0),
 (3,'foreign','اسحاق نیوتن','فیزیک','نیوتون در زمینه های مختلفی مثل ریاضیات، فیزیک و فلسفه ی طبیعی در کنار سایر رشته ها مهارت زیادی داشت. نیوتون بیشتر به خاطر نقشی که در تلاش و نهایتاً روشن کردن قانون گرانش و سه قانون حرکت داشت شناخته شده است. هیچ نشانه ای در زندگی جوانی این مرد بزرگ دانش وجود نداشت که نشان دهد اویکی از مشهور ترین دانشمندان دنیا خواهد شد ولی او توانست بر تمام موانعی که در برابرش بود غلبه کند و پیروز شود.','http://uupload.ir/files/r6my_3_sir-isaac-newton.jpg',0),
 (4,'foreign','ارشمیدس','ریاضی و مکانیک','ارشمیدس یكی از بزرگترین دانشمندان ریاضی و مكانیك در عصر خودش بود. درباره خصوصیات زندگی ارشمیدس اطلاعات زیادی در دست نیست. اما علاقه اش به ریاضیات و مسائل علمی مكانیك سبب شده است كه كارهای با ارزشی از او باقی بماند. گفته می شود كه وقتی به مساله ای علاقمند می شد از خوردن و خفتن غافل می شد و چنان خود را سرگرم كار و حل مشكل می كرد كه هر مساله دیگری او را از كار باز نمی داشت. از آثار علمی او می توان كشف قانون مایع ها و گازها ( معروف به قانون ارشمیدس در شاره ها)، تعیین جرم حجمی طلا و تقره و بعضی فلزات دیگر و اختراع پیچ مخصوص حلزونی شكل به نام پیچ ارشمیدس برای بالا بردن آب اشاره كرد.','http://uupload.ir/files/4kwh_4_archimedes.jpeg',0),
 (5,'foreign','توماس ادیسون','فیزیک','هیچ دانشمند دیگری نتوانسته است مثل ادیسون بیش از 1000 اختراع ثبت شده داشته باشد. مثل انیشتین، ادیسون هم در کودکی مشکلات یادگیری داشت. دستگاه گرامافون و لامپ الکتریکی از اختراعات اوست.','http://uupload.ir/files/lblo_5-thomas-edison.jpg',0),
 (6,'foreign','لوئی پاستور','پزشکی','لوئی بیشتر به خاطر تلاش هایی که در زمینه ی پزشکی انجام داده شناخته شده است. نظریه ی جوانه (germ) اولین بار بوسیله ی او معرفی شد و در ازآن پس در مطالعات میکرو بیولوژی مورد استفاده قرار می گیرد.','http://uupload.ir/files/3xqo_6_louis-pasteur.jpg',0),
 (7,'foreign','ماری کوری','فیزیک','پیر و ماری کوری هر دو از دانشمندان بزرگ تاریخ بودند آنها در سال ۱۸۹۵ با هم ازدواج کردند. در سال ۱۹۰۳ جایزه نوبل فیزیک به طور مشترک برای کار بر روی تابش به آنها اهدا شد. پیر کوری در سال ۱۹۰۶ و تنها ۹ سال پس از ازدواجش با ماری در یک حادثه خیابانی درگذشت. ماری کوری نیز در سال ۱۹۳۴ درگذشت. مرگ وی را بخاطر قرارگرفتن بیش از حد در معرض تشعشع اعلام کردند. هر چند که در این مورد اتفاق نظر وجود ندارد.','http://uupload.ir/files/8z2j_7-marie-curie.jpg',0),
 (8,'foreign','گالیله','فیزیک','تا به امروز گالیله هنوز هم به عنوان کسی که بیشترین سهم را در پیشرفت علم داشته شناخته شده است. با وجود اینکه به خاطر اعتقادش توسط کلیسا مورد آزار و اذیت قرار گرفت اما حتی آن هم او را از انجام اکتشافاتی که در عصر حاضر هم مورد استفاده هستند باز نداشت. او نه تنها یک فیزیکدان بلکه ستاره شناس و فیلسوف هم بود. سهم او در پیشرفت علم، اختراع تلسکوپ و بیان دو قانون اول حرکت را در بر دارد.','http://uupload.ir/files/icck_8_galileogalilei.jpg',0),
 (9,'foreign','مایکل فارادی','شیمی و فیزیک','یکی از تاثیرگذارترین دانشمند تاریخ بشریت. داشتن تخصص در دو زمینه شیمی و فیزیک عامل بسیاری از نوآوری های اوست. او در سال ۱۹۷۱ در انگلستان زاده شد. کار های او بر روی الکترومغناطیس و الکتروشیمی پایه گذار بسیاری از اختراعات بود. کشف قانون الکترولیز و قوانین مربوط به الکترومغناطیس که زیربنای ساخت موتورهای الکتریکی است از دستآورد های اوست. فاردای مرد اندیشه و اعتقاد بود. او پیشنهاد دولت بریتانیا را برای کمک به ساخت سلاح شیمیایی رد کرد.','http://uupload.ir/files/axbo_9-faraday-millikan-gale.jpg',0),
 (10,'foreign','ارسطو','فلسفه','ارسطو به عنوان برجسته ترین فیلسوف دوران خودش شناخته شده است. او دانش وسیعی در رشته های مختلف داشت، که تنها عده ی کمی از دانشمندان قادر به این کار بوده اند.او دررشته های فیزیک، جانور شناسی، بیولوژی، سیاست، علم اخلاق و منطق علاوه بررشته های دیگر نیز نقش داشته است. با وجود اینکه ارسطو صد ها سال پیش از این زندگی می کرده است اماهنوز هم در عصر حاضر نتیجه ی اقدامات او احساس می شود.','http://uupload.ir/files/wlng_10-aristotle.jpg',0),
 (11,'irani','ابوریحان بیرونی','ریاضی و فیزیک ',' درسال‌های ۳۵۲ تا ۴۲۷ هجری شمسی

که بود؟ ابوریحان دانشمند و ریاضی‌دان، ستاره‌شناس، تقویم‌شناس، انسان‌شناس و تاریخ‌نگار برجسته ایرانی در سده چهارم هجری بوده است. پدر ابوریحان، اخترشناس دربار خوارزمشاه و مادرش نیز ماما بوده است. پدر ابوریحان را به دلیل حسادت و بدگویی از دربار اخراج کردند و پس از آن در یک روستا در اطراف خوارزم ساکن شدند. گفته می‌شود دلیل شهرت او به بیرونی نیز همین موضوع است، چون آن‌ها برای مردم روستا بیگانه بودند. بیرونی را از بزرگ‌ترین دانشمندان مسلمان و یکی از بزرگ‌ترین دانشمندان فارسی‌زبان در همه اعصار می‌دانند.
ابوریحان از اولین کسانی است که به پیدا کردن وزن مخصوص بسیاری از اجسام مبادرت کرد و آن‌چنان این کار را دقیق انجام داد که اختلاف وزن‌های محاسبه‌شده‌اش با وزن‌هایی که دانشمندان در قرن‌های اخیر با توجه به تمام وسایل و فناوری‌های جدید خود تهیه کرده‌اند، بسیار ناچیز است. همچنین ابوریحان در طول عمر خود به شهر‌های مختلفی سفر می‌کرد و به اندازه‌گیری طول و عرض جغرافیایی آن شهر‌ها می‌پرداخت و سپس موقعیت هر شهر را روی یک کره مشخص می‌کرد و پس از سال‌ها توانست آن نقاط را روی یک نقشه مسطح پیاده کند.

او در ۱۷ سالگی ارتفاع خورشیدی نصف‌النهار را رصد کرد و یکی از مهم‌ترین فعالیت‌ها و دستاورد‌های او، محاسبه شعاع کره زمین است که تا قبل از او، حتی تخمینی هم در این باره وجود نداشت! گفته می‌شود که ابوریحان مؤلف حدود ۱۴۵ کتاب بوده که در مجموع شامل ۱۳ هزار صفحه است. بیش از ۹۰ مورد آن‌ها مربوط به ستاره‌شناسی، ریاضی و ریاضیات زمین‌شناسی بوده، اما متاسفانه با گذشت سال‌ها، تنها ۳۵ اثر از ابوریحان بیرونی به جا مانده است.

در ضمن معروف است که در واپسین ساعات عمر ابوریحان شخصی به دیدنش آمد و او در بستر بیماری پاسخ مسئله‌ای علمی را از وی پرسید. اطرافیان که از کار او متعجب شده بودند، از بحث علمی برحذرش داشتند؛ ابوریحان در پاسخ چنین گفت: «آیا پاسخ این سوال را بدانم و بمیرم بهتر است یا ندانسته بمیرم؟». ابوریحان بیرونی در سن ۷۸ سالگی از دنیا رفت.','http://uupload.ir/files/dbd1_11_abureihan.jpg',0),
 (12,'irani','خواجه نصیر طوسی','فیزیک و ریاضی','شاعر، فیلسوف، متکلم، فقیه، ستاره‌شناس، اندیشمند، ریاضی دان، منجم، پزشک و معمار ایرانی که به القابی، چون «نصیرالدین»، «محقق توسی»، «استاد البشر» و «خواجه» شهرت دارد.
توسی سنت فلسفه مشایی را که پس از ابن‌سینا در ایران رو به افول گذاشته بود، بار دیگر احیا کرد. وی با استفاده از آرای فلسفی ابن‌سینا کلام شیعه را بر برهان‌های عقلی مبتنی کرد و مجموعه آرا و دیدگاه‌های کلامی شیعه را در کتاب «تجرید الاعتقاد» گرد آورد. او در زمینه نجوم، رصدخانه مراغه را ساخت و در کنار آن کتابخانه‌ای به وجود آورد که نزدیک به ۴۰ هزار جلد کتاب در آن بوده است.

توسی با پرورش شاگردانی همچون قطب الدین شیرازی و گردآوری دانشمندان ایرانی عامل انتقال تمدن و دانش‌های ایران پیش از مغول به آیندگان شد. این دانشمند شیعه، در نحوه استفاده از ساعت آفتابی ابتکار جدیدی برای رصد کردن به خرج داده است که این ابتکار در علم ستاره‌شناسی بسیار ارزشمند و ماندگار بوده است. خواجه نصیرالدین همچنین یکی از گسترش‌دهندگان علم مثلثات بوده که در سده ۱۶ میلادی کتاب‌های مثلثات او به زبان فرانسه ترجمه شده است.','http://uupload.ir/files/lyhz_12_khajenasir.jpg',0),
 (13,'irani','جابر ابن حیان','شیمی','در سال‌های ۷۲۱ تا ۸۱۵ هجری شمسی می زیسته است.
این فیلسوف بزرگ ایرانی را «پدر علم شیمی» نامیده‌اند و در این زمینه تاثیر فراوانی بر کیمیاگران و شیمی دان‌های جهان گذاشته است.
جابربن حیان در زمان حیات خود در زمینه‌های کیمیاگری، نجوم، پزشکی، فلسفه و فیزیک به دستاورد‌های بزرگی رسید. از این قبیل می‌توان به برخی از وسایل آزمایشگاهی که وی اختراع کرده است، مانند «انبیق» و «قرع» اشاره کرد. کشف مواد شیمیایی بسیاری مانند نیتریک اسید، سیتریک اسید (جوهر لیمو)، تیزاب (از جمله اندک موادی است که طلا را در خود حل می‌کند)، استیک اسید (جوهر سرکه) و معرفی کردن فرایند‌های تقطیر و تبلور که هر دوی آن‌ها به عنوان پایه‌های اصلی شیمی امروزی به شمار می‌آیند، از دستاورد‌های علمی جابربن‌حیان است.','http://uupload.ir/files/ovyh_13_jaberhayan.jpg',0),
 (14,'irani','محمد بن زکریای رازی','پزشکی','در چه دوره‌ای زیست؟ در سال‌های ۲۴۳ تا ۳۰۴ هجری شمسی؛ که بود؟ پزشک، فیلسوف و شیمی‌دان ایرانی که در آخر عمرش نابینا شد.
دستاورد‌های علمی‌اش چه بود؟ او بیش از هر چیز به کشف الکل شناخته می‌شود. رازی توانست این ماده را از مواد نشاسته‌ای و قندی تخمیر شده به دست آورد. او البته نخستین کسی بود که ماده شیمیایی جوهر گوگرد H۲So۴ که امروزه آن را «اسیدسولفوریک» می‌نامند کشف کرد.
از دیگر اکتشافات او در شیمی می‌توان به اسید کلریدریک اشاره کرد که از تأثیر آب آهک بر نشادر به دست آورد. رازی همچنین با اثر دادن سرکه با مس، استات مس یا زنگار تهیه کرد که با آن‌ها زخم را شست وشو می‌دادند. وی همچنین آثار ماندگاری در زمینه پزشکی، شیمی و فلسفه نوشته است. زکریا درباره کیهان‌شناسی، منطق و ریاضیات نیز آثاری دارد.
این دانشمند ۵۶ کتاب در زمینه طب، ۳۳ کتاب در طبیعیات، ۱۰ کتاب در زمینه ریاضیات، نجوم و ... دارد. به گفته «جرج سارتن» پدر تاریخ علم، رازی بزرگ‌ترین پزشک ایران و جهان اسلام در زمان قرون وسطی بوده است.','http://uupload.ir/files/g6dw_14_razi.jpg',0),
 (15,'irani','محمد بوزجانی','ریاضی','در چه دوره‌ای زیست؟ درسال‌های ۳۱۹ تا ۳۷۶ هجری شمسی
که بود؟ وی ریاضی دان و منجم بزرگ ایرانی در دوران طلایی اسلام بوده است.
دستاورد‌های علمی‌اش چه بود؟ بوزجانی، روش‌های محاسبه‌ای را که بازرگانان به کار می‌بردند ارتقا بخشید و بعضی از روش‌های ناصحیح را نیز مورد انتقاد قرار داد. او روش‌های ساختن اشکال دوبعدی و سه‌بعدی را عرضه کرد که اقتباس از اقلیدس و ارشمیدس بوده و ابتکارات خوبی در همین زمینه به آن اضافه کرده است.

قبل از بوزجانی، در مثلثات کروی، تنها وسیله حل مثلث‌ها قضیه منلائوس راجع به چهارضلعی کامل بود که در کتاب‌های اسلامی به قاعده مقادیر ششگانه موسوم بود. بوزجانی با غنی‌تر ساختن ابزار مثلثات کروی، حل مسائل آن‌ها را راحت‌تر کرد. در ضمن یکی از اولین اثبات‌های قضیه کلی سینوس‌ها برای حل مثلث‌های غیر قائم الزاویه، توسط بوزجانی ابداع شد.
وی مسائل لاینحل هندسه کلاسیک را حل و تحقیقاتی در اصول ترسیمات هندسی کرد که تا امروز هنوز کسی موفق به ارائه راه‌حل دیگری برای حل آن مسائل نشده است. در ضمن، او اولین کسی است که مطالعات دقیقی درباره کره ماه انجام داده است و به نتایجی جالب درباره آن دست یافت که این روزها، صحت‌شان اثبات شده است.
','http://uupload.ir/files/g225_15_buzanjani.jpg',0),
 (16,'irani','غیاث‌الدین جمشید کاشانی','ریاضی','در چه دوره‌ای زیست؟ در سال‌های ۷۵۸ تا ۸۰۸ هجری شمسی

که بود؟ وی فرزند پزشکی کاشانی به نام مسعود بود. او زبردست‌ترین حساب‌دان و آخرین ریاضی‌دان برجسته دوره اسلامی و از بزرگ‌ترین مفاخر تاریخ ایران به شمار می‌آید.

دستاورد‌های علمی‌اش چه بود؟ او در یکی از فعالیت‌های متعدد علمی خود به تکمیل و تصحیح روش‌های قدیمی انجام چهار عمل اصلی حساب پرداخت و روش‌های جدید و ساده‌تری برای آن‌ها اختراع کرد. در واقع، کاشانی را باید مخترع روش‌های کنونی انجام چهار عمل اصلی حساب (به ویژه ضرب و تقسیم) دانست. کتاب ارزشمند وی با نام مفتاح الحساب کتابی درسی، درباره ریاضیات مقدماتی است و آن را از نظر فراوانی و تنوع مواد و مطالب و روانی بیان سرآمد همه آثار ریاضی سده‌های میانه می‌دانند.','http://uupload.ir/files/9qgl_16_kashani.jpg',0),
 (17,'irani','محمد بن موسی خوارزمی','ریاضی ','در چه دوره‌ای زیست؟ درسال‌های ۱۵۹ تا ۲۲۹ هجری شمسی

که بود؟ این ریاضی دان، ستاره‌شناس، فیلسوف، جغرافی دان و مورخ شهیر ایرانی در دوره عباسیان زندگی می‌کرده است.

دستاورد‌های علمی‌اش چه بود؟ شهرت علمی خوارزمی مربوط به کار‌هایی است که در ریاضیات به ویژه در رشته جبر، انجام داده به طوری که او را «پدر جبر» نامیده‌اند. جرج سارتن، مورخ مشهور در مقدمه کتاب خود، سده نهم میلادی را «عصر خوارزمی» می‌نامد.

بیشترین چیره‌دستی وی در حل معادله‌های خطی و درجه دوم بوده است. یکی از کتاب‌های او باعث شد که دستگاه عددی در اروپا ازعددنویسی رومی به عددنویسی هندی-عربی تغییر پیدا کند، چیزی که هنوز نیز در اروپا و دیگر نقاط جهان فراگیر است. او در زمان مامون عباسی مسئول تهیه اطلسی از نقشه‌های آسمان و زمین بود. جشنواره خوارزمی نام یک جشنواره علمی در ایران است که به منظور ارج نهادن به مقام دانش پژوهان و فناوران نوآور به نام این دانشمند بزرگ، نام‌گذاری شده است.','http://uupload.ir/files/w972_18_kharazmi.jpg',0),
 (18,'irani',' ابوعلی سینا','پزشکی','در چه دوره‌ای زیست؟ در سال‌های ۳۵۹ تا ۴۱۶ هجری شمسی

که بود؟ ابوعلی سینا اول شهریور ۳۵۹ در شهر بخارا و در دوران سامانیان به‌دنیا آمد. وی حافظه و هوشی خارق‌العاده داشت به طوری‌که در ۱۴ سالگی از آموزگار خود پیشی گرفت. ابوعلی‌سینا پزشک نامدار ایرانی است که آرامگاهش در شهر همدان قرار دارد و روز اول شهریور را به افتخار وی «روز پزشک» نام گذاری کرده‌اند.

دستاورد‌های علمی‌اش چه بود؟ وی ۴۵۰ کتاب در زمینه‌های گوناگون نوشته است که شمار زیادی از آن‌ها درباره پزشکی و فلسفه است. وی نویسنده کتاب شفا که یک دانشنامه علمی و فلسفی جامع است و القانون فی الطب یکی از معروف‌ترین آثار تاریخ پزشکی است. آثاری که وی را در تمام دنیا مشهور و متمایز کرده و پایه‌گذار بسیاری از علوم پزشکی است و اختراعات و اکتشافات بسیاری را از خود به جا گذاشته یا مراحل کشف‌شان را پایه‌ریزی کرده است.','http://uupload.ir/files/lunc_19_khayam.jpg',0),
 (19,'irani',' خیام نیشابوری','نجوم','در چه دوره‌ای زیست؟ در سال‌های ۴۲۷ تا ۵۱۰ هجری شمسی

که بود؟ خیام، فیلسوف، ریاضی دان، ستاره‌شناس و رباعی‌سرای ایرانی در دوره سلجوقی است. گرچه پایگاه علمی خیام برتر از جایگاه ادبی اوست، ولی آوازه وی بیشتر به خاطر رباعیاتش است که شهرت جهانی دارد.

دستاورد‌های علمی‌اش چه بود؟ یکی از برجسته‌ترین کار‌های وی را می‌توان سر و سامان دادن و سرپرستی محاسبات گاه‌شماری ایران در زمان وزارت خواجه نظام‌الملک که در دوره پادشاهی ملک‌شاه سلجوقی بود، دانست؛ محاسبات منسوب به خیام در این زمینه، هنوز معتبر است و دقتی به مراتب بالاتر از گاه‌شماری میلادی دارد.','http://uupload.ir/files/ptpz_20_omar-khayyam.jpg',0);
COMMIT;
